In [2]:
import numpy as np 
import pandas as pd
import math

In [3]:
#1 
def bases(x):
    
    letters = ["0","1","2","3","4","5","6","7","8","9",
               "a","b","c","d","h","f"]
    for base in [2,8,16]:
        tmp = x
        string=""
        for i in range(int(math.log(x,base))+1):
            string= letters[tmp%base]+string
            tmp = tmp//base
        print(string)

In [4]:
bases(34+35)

1000101
105
45

In [5]:
#2
cast=pd.read_csv("C:\\Users\\lior1\\Downloads\\cast.csv")

In [6]:
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [7]:
cast["title"].value_counts()["Hamlet"]

299

In [10]:
cast[cast["title"]=="Treasure Island"].sort_values(by="year")

,title,year,name,type,character,n
1312766,Treasure Island,1918,Herschel Mayall,actor,Prologue Player,NaN
3280557,Treasure Island,1918,Eleanor Washington,actress,Prologue Player,NaN
3046750,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1167783,Treasure Island,1918,Raymond Lee,actor,Bit Role,NaN
1195421,Treasure Island,1918,Elmo Lincoln,actor,Prologue Player,NaN
...,...,...,...,...,...,...
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

In [25]:
cast[(cast["title"]=="Hamlet")& (cast["year"]==1921) ].count()["n"]

9

In [31]:
movies=pd.read_csv("C:\\Users\\lior1\\homework\\דאטה סט לעבודת יחיד פרוייקט גמר.txt")
movies[movies["title"]=="Hamlet"]["year"].groupby((movies["year"]//10)*10).count()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    4
Name: year, dtype: int64

In [33]:
cast[(cast["n"]==1)&(cast["year"]>1949)&(cast["year"]<1960)]["n"].count()

9201

In [36]:
cast[["name","n"]][cast["n"]==1].groupby("name").count().sort_values("n",ascending=False).head(10)

                     n
name
Charles Starrett   200
Mohanlal           184
Mammootty          177
Buck Jones         130
Rajesh Khanna      127
Johnny Mack Brown  124
John Wayne         117
Amitabh Bachchan   113
Bob Steele         110
Dharmendra         107

In [41]:
group=cast[cast["name"]=="Frank Oz"].groupby(["year","title"]).agg({"n":"count"})
group[group["n"]>1]

                                               n
year title
1979 The Muppet Movie                          8
1981 An American Werewolf in London            2
     The Great Muppet Caper                    6
1982 The Dark Crystal                          2
1984 The Muppets Take Manhattan                7
1985 Sesame Street Presents: Follow that Bird  3
1992 The Muppet Christmas Carol                7
1996 Muppet Treasure Island                    4
1999 Muppets from Space                        4
     The Adventures of Elmo in Grouchland      3